.model small
.stack 100h

; Оголошення зовнішніх процедур, які визначаються в іншому файлі
extrn set_graphic_mode:proc   ; Процедура встановлення графічного режиму
extrn set_text_mode:proc      ; Процедура повернення до текстового режиму
extrn draw_char:proc          ; Процедура малювання символу
extrn draw_rectangle:proc     ; Процедура малювання прямокутника
extrn draw_pixel:proc         ; Процедура малювання пікселя

.data

    color        dw 0                                         ; Початковий колір
    mode         db 0                                         ; Початковий графічний режим

.code
    start:          
                    mov  ax, @data
                    mov  ds, ax                     ; Встановлюємо сегмент даних

    cycle_modes:    
    ; Встановлення графічного режиму
                    mov  al, [mode]
                    call set_graphic_mode

    ; Малювання кількох прямокутників з різними кольорами
                    mov  cx, 0                      ; Початкова X координата
                    mov  ax, [color]                ; Колір пікселя (спочатку чорний)
                    mov  dx, 10                     ; Початкова Y координата
    cycle_rectangle:
                    add  cx, 10                     ; Зміщуємо X координату на 10
                    mov  bx, 10                     ; Ширина прямокутника
                    mov  si, 10                     ; Висота прямокутника
                    call draw_rectangle             ; Викликаємо процедуру малювання прямокутника
                    inc  ax                         ; Змінюємо колір пікселя
                    cmp  cx, 640                    ; Перевіряємо, чи не перевищили максимальну X-координату
                    jl   cycle_rectangle            ; Повертаємося до циклу, якщо X-координата менша за 640
    ; Перехід на новий рядок
                    add  dx, 10                     ; Зміщуємо Y координату на 10
                    xor  cx, cx                     ; Зануляємо X координату
                    cmp  ax, 255                    ; Перевіряємо, чи не вийшли за межі 255 кольорів
                    jl   cycle_rectangle 

    ; Очікування натискання клавіші користувачем
                    mov  ah, 0
                    int  16h

    ; Перехід до наступного графічного режиму
                    inc  [mode]
                    cmp  [mode], 3                  ; Переходимо до наступного режиму, перевіряємо межу (3)
                    jl   cycle_modes                ; Повертаємося до початку циклу, якщо режим менший за 3

    ; Повернення до текстового режиму
                    call set_text_mode

    ; Завершення програми
                    mov  ax, 4C00h
                    int  21h
end start